avr-rust/avrd/packs/atmega/ATmega2561.atdf
        <register caption="Timer/Counter5 Output Compare Register A  Bytes" name="OCR5A" offset="0x128" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter5 Output Compare Register B  Bytes" name="OCR5B" offset="0x12A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter5 Output Compare Register B  Bytes" name="OCR5C" offset="0x12C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter5 Input Capture Register  Bytes" name="ICR5" offset="0x126" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter5 Interrupt Mask Register" name="TIMSK5" offset="0x73" size="1">
          <bitfield caption="Timer/Counter5 Input Capture Interrupt Enable" mask="0x20" name="ICIE5"/>
          <bitfield caption="Timer/Counter5 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE5C"/>
          <bitfield caption="Timer/Counter5 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE5B"/>
          <bitfield caption="Timer/Counter5 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE5A"/>
          <bitfield caption="Timer/Counter5 Overflow Interrupt Enable" mask="0x01" name="TOIE5"/>
        </register>
        <register caption="Timer/Counter5 Interrupt Flag register" name="TIFR5" offset="0x3A" size="1" ocd-rw="">
          <bitfield caption="Input Capture Flag 5" mask="0x20" name="ICF5"/>
          <bitfield caption="Output Compare Flag 5C" mask="0x08" name="OCF5C"/>
          <bitfield caption="Output Compare Flag 5B" mask="0x04" name="OCF5B"/>
          <bitfield caption="Output Compare Flag 5A" mask="0x02" name="OCF5A"/>
          <bitfield caption="Timer/Counter5 Overflow Flag" mask="0x01" name="TOV5"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC4">
        <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xA0" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM4A"/>
          <bitfield caption="Compare Output Mode 4B, bits" mask="0x30" name="COM4B"/>
          <bitfield caption="Compare Output Mode 4C, bits" mask="0x0C" name="COM4C"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM4"/>
        </register>
        <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xA1" size="1">
          <bitfield caption="Input Capture 4 Noise Canceler" mask="0x80" name="ICNC4"/>
          <bitfield caption="Input Capture 4 Edge Select" mask="0x40" name="ICES4"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM4" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 4" mask="0x07" name="CS4" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 4 Control Register C" name="TCCR4C" offset="0xA2" size="1">
          <bitfield caption="Force Output Compare 4A" mask="0x80" name="FOC4A"/>
          <bitfield caption="Force Output Compare 4B" mask="0x40" name="FOC4B"/>
          <bitfield caption="Force Output Compare 4C" mask="0x20" name="FOC4C"/>
        </register>
        <register caption="Timer/Counter4  Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register A  Bytes" name="OCR4A" offset="0xA8" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register B  Bytes" name="OCR4B" offset="0xAA" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Output Compare Register B  Bytes" name="OCR4C" offset="0xAC" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Input Capture Register  Bytes" name="ICR4" offset="0xA6" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
          <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
          <bitfield caption="Timer/Counter4 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE4C"/>
          <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE4B"/>
          <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE4A"/>
          <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
        </register>
        <register caption="Timer/Counter4 Interrupt Flag register" name="TIFR4" offset="0x39" size="1" ocd-rw="">
          <bitfield caption="Input Capture Flag 4" mask="0x20" name="ICF4"/>
          <bitfield caption="Output Compare Flag 4C" mask="0x08" name="OCF4C"/>
          <bitfield caption="Output Compare Flag 4B" mask="0x04" name="OCF4B"/>
          <bitfield caption="Output Compare Flag 4A" mask="0x02" name="OCF4A"/>
          <bitfield caption="Timer/Counter4 Overflow Flag" mask="0x01" name="TOV4"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC3">
        <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM3A"/>
          <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
          <bitfield caption="Compare Output Mode 3C, bits" mask="0x0C" name="COM3C"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM3"/>
        </register>
        <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
          <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
          <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
          <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM3" lsb="2"/>
          <bitfield caption="Prescaler source of Timer/Counter 3" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 3 Control Register C" name="TCCR3C" offset="0x92" size="1">
          <bitfield caption="Force Output Compare 3A" mask="0x80" name="FOC3A"/>
          <bitfield caption="Force Output Compare 3B" mask="0x40" name="FOC3B"/>
          <bitfield caption="Force Output Compare 3C" mask="0x20" name="FOC3C"/>
        </register>
